       >>SOURCE FORMAT FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-TEXT PIC X(30) VALUE "HELLO with variable".


       PROCEDURE DIVISION.
           DISPLAY VAR-TEXT.
           STOP RUN.
