       IDENTIFICATION DIVISION.
       PROGRAM-ID. OPGAVE2.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  KUNDEID     PIC 9(10) VALUE ZEROS.
       01  FORNAVN     PIC X(20) VALUE SPACES.
       01  EFTERNAVN   PIC X(20) VALUE SPACES.
       01  KONTONUMMER PIC X(30) VALUE SPACES.
       01  BALANCE     PIC S9(7)V99 VALUE ZEROS.
       01  VALUTAKODE  PIC X(3) VALUE SPACES. 

       PROCEDURE DIVISION.
           MOVE 1234567890 TO KUNDEID.
           MOVE "LARS" TO FORNAVN.
           MOVE "MADSEN" TO EFTERNAVN.
           MOVE "DKK0000000001111111" TO KONTONUMMER.
           MOVE 9.50 TO BALANCE.
           MOVE "EUR" TO VALUTAKODE.
           DISPLAY "Kunde-ID: " KUNDEID.
           DISPLAY "Fornavn og Efternavn: " FORNAVN " " EFTERNAVN.
           DISPLAY "Kontonummer: " KONTONUMMER.
           DISPLAY "Balance og valutakode: " BALANCE " " VALUTAKODE.
           STOP RUN.
